import s from "./Delivery.module.scss";

const DeliveryItem = () => {
  return (
    <>
      <div className={s.item}>
        <div>
          <div className={s.itemContent}>
            <div className={s.itemIcon}>
              <svg id="delivery-courier" viewBox="0 0 75 75">
                <g>
                  <circle fill="#dd011c" cx="37.5" cy="37.5" r="37.5"></circle>
                  <g>
                    <path
                      fill="#fff"
                      className="b5"
                      d="M37.5,36A9.511,9.511,0,0,0,47,26.5c0-8.515-5.422-9.5-9.5-9.5-4.145,0-8.865.949-9.441,8H23v2h5.025A9.5,9.5,0,0,0,37.5,36Zm0-2a7.5,7.5,0,0,1-7.475-7h14.95A7.5,7.5,0,0,1,37.5,34Zm0-15c4.111,0,6.959,1.076,7.425,6H30.072C30.518,20.06,33.271,19,37.5,19Z"
                    ></path>
                    <path
                      fill="#fff"
                      className="b5"
                      d="M47.372,42.459C46.761,39.583,45,38,42.406,38H32.594c-2.59,0-4.354,1.583-4.966,4.46L24.767,56H50.233Zm-17.787.416C30.2,40,32,40,32.594,40h9.812c.594,0,2.4,0,3.009,2.873L47.767,54H27.233Z"
                    ></path>
                  </g>
                </g>
              </svg>
            </div>

            <p className={s.itemTitle}>
              Курьером Москва до МКАД и <br />
              Санкт-Петербург до КАД
            </p>
            <p className={s.itemSubTitle}>
              При заказе от 3000 <span className="g-rouble-thin"></span>{" "}
              бесплатная доставка.
            </p>
            <p className={s.itemTabl}>
              <span className={s.tableColumn}>
                с 10:00 до 18:00
                <br />
                с 10:00 до 13:00
                <br />
                с 13:00 до 16:00
                <br />
                с 16:00 до 19:00
                <br />
                с 19:00 до 22:00
                <br />
                с 10:00 до 22:00
                <br />
              </span>{" "}
              <span className={s.tableColumnTwo}>
                Доставка МСК на следующий день.
                <br />
                СПБ через день. (при подтверждении заказа до 18:00){" "}
              </span>
            </p>
          </div>
        </div>
        <p className={s.itemCost}>360 р</p>
      </div>
      <div className={s.item}>
        <div>
          <div className={s.itemContent}>
            <div className={s.itemIcon}>
              <svg id="delivery-fast" viewBox="0 0 75 75">
                <g>
                  <circle
                    fill="#dd011c"
                    className="a5"
                    cx="37.5"
                    cy="37.5"
                    r="37.5"
                  ></circle>
                  <path
                    fill="#fff"
                    className="b5"
                    d="M61.486,32.737l-4.508-3.606A5.816,5.816,0,0,0,53.755,28H47V24.474A2.477,2.477,0,0,0,44.525,22H21.475A2.477,2.477,0,0,0,19,24.474V32H9v2H19v3H13v2h6v7.526A2.477,2.477,0,0,0,21.475,49H23.1a5,5,0,0,0,9.8,0H44.525A2.452,2.452,0,0,0,46,48.505,2.431,2.431,0,0,0,47.458,49H49.1a5,5,0,0,0,9.8,0h1.643A2.461,2.461,0,0,0,63,46.542V35.887A4.429,4.429,0,0,0,61.486,32.737ZM28,51a3,3,0,1,1,3-3A3,3,0,0,1,28,51Zm16.525-4H32.9a5,5,0,0,0-9.8,0H21.475A.481.481,0,0,1,21,46.526V39h2V37H21V34h5V32H21V24.474A.481.481,0,0,1,21.475,24h23.05a.481.481,0,0,1,.475.474V46.526A.481.481,0,0,1,44.525,47ZM54,51a3,3,0,1,1,3-3A3,3,0,0,1,54,51Zm7-4.458a.464.464,0,0,1-.458.458H58.9a5,5,0,0,0-9.8,0H47.458A.464.464,0,0,1,47,46.542V30h6.755a3.87,3.87,0,0,1,1.973.692L60.236,34.3A2.46,2.46,0,0,1,61,35.887Z"
                  ></path>
                </g>
              </svg>
            </div>

            <p className={s.itemTitle}>Курьером Москва за МКАД и МО</p>
            <p className={s.itemSubTitle}>
              При заказе от 3000 бесплатная доставка.
            </p>
            <p className={s.itemTabl}>
              <span className={s.tableColumn}>
                <br />
                с 14:00 до 18:00 с 10:00 до 14:00
                <br />
                с 18:00 до 22:00
                <br />с 10:00 до 22:00{" "}
              </span>
              <span className={s.tableColumnTwo}>
                Доставка через день (при подтверждении заказа до 18:00)
              </span>
            </p>
          </div>
        </div>
        <p className={s.itemCost}>360 р</p>
      </div>
      <div className={s.item}>
        <div>
          <div className={s.itemContent}>
            <div className={s.itemIcon}>
              <svg id="delivery-express" viewBox="0 0 75 75">
                <g>
                  <circle cx="37.5" cy="37.5" r="37.5" fill="#dd011c"></circle>
                  <path
                    fill="#fff"
                    d="M38.4 49.3v1.8c0 .2-.2.3-.3.3h-1.2c-.2 0-.3-.2-.3-.3v-1.8c0-.2.2-.3.3-.3h1.2c.2-.1.3.1.3.3zm5.6-2.1c0-.1-.1-.1-.2-.2h-.3l-1.1.6c-.1 0-.1.1-.2.2v.3l.9 1.6c0 .1.1.1.2.2H43.6l1.1-.6c.2-.1.2-.3.1-.5l-.8-1.6zm3.8-4.5c-.2-.1-.4 0-.5.1l-.6 1.1c0 .1-.1.2 0 .3 0 .1.1.2.2.2l1.6.9h.2c.1 0 .2-.1.3-.2l.6-1.1c0-.1.1-.2 0-.3 0-.1-.1-.2-.2-.2l-1.6-.8zm-16.4 4.4c-.1 0-.2-.1-.3 0l-.1.1-1 1.6c-.1.2 0 .4.1.5l1.1.6h.2c.1 0 .2-.1.3-.2l.9-1.6c.1-.2 0-.4-.1-.5l-1.1-.5zm18.7-23.3c.1.1.2.1.2.1.1 0 .2 0 .2-.1l.3-.3.6-.6c.1-.1.2-.1.2-.1s.1 0 .2.1l.6.6.2.2s0 .1-.2.2l-.9.9c-.1.1-.1.2-.1.2s0 .2.1.2l1 .9c.1.1.2.1.2.1.1 0 .2 0 .2-.1l.3-.3c.3-.2.5-.5.7-.7.8-.8.8-2.1 0-3l-.9-.9c-.7-.7-1.8-.8-2.6-.3-.4.3-.8.6-1.1.9l-.4.4c-.1.1-.1.2-.1.2s0 .2.1.3l1.2 1.1zm-28.5 2.1l.3.3c.1.1.2.1.2.1.1 0 .2 0 .2-.1l1-.9c.1-.1.1-.2.1-.2s0-.2-.1-.2l-.3-.3-.7-.7c-.1-.1-.1-.1 0-.3l.8-.8c.1-.1.1-.1.2 0s.2.1.2.2l.8.8c.1.1.2.1.2.1.1 0 .2 0 .2-.1l.9-1c.1-.1.1-.3 0-.5-.1-.1-.2-.2-.3-.4-.2-.3-.5-.5-.8-.8-.8-.7-2.1-.7-2.9.1l-.9.9c-.7.8-.8 1.9-.2 2.7l1.1 1.1zm9.4 2.7c.1.1.2.2.3.2h.2l1.1-.6c.2-.1.2-.3.1-.5l-1-1.7c0-.1-.1-.1-.2-.2h-.3l-1.1.6c-.1.2-.1.4-.1.6l1 1.6zm3.6 9.9c-.2-1.2.2-2.2 1.2-3 1-.7 2-.8 3.1-.2.6.3 1.1.9 1.4 1.6h8.5c-.3-2.9-1.4-5.3-3.5-7.2-2.1-2-4.7-3.1-7.8-3.1-.2 0-.3-.2-.3-.3V25c0-.2.1-.3.3-.3 3.5-.1 6.9 1.4 9.5 4 2.6 2.6 3.9 6.1 3.8 9.9 0 .2-.2.3-.3.3H40.3c0 .1-.1.1-.1.2-.1.3-.3.5-.5.8-.6.7-1.3 1-2.1 1-.3 0-.5 0-.8-.1-1.2-.3-2-1.1-2.2-2.3zm2.9.4c.6 0 1-.4 1-1 0-.3-.1-.5-.3-.7-.2-.2-.4-.3-.7-.3-.3 0-.5.1-.7.3-.2.2-.3.4-.3.7 0 .6.4 1 1 1zm18.2 1c-1 9.3-8.9 16.3-18.3 16.3h-1.2c-8.9-.6-16-7.5-17-16.4-.5-5.2.9-9.9 4.4-13.9 3.3-3.8 7.6-5.9 12.8-6.3v-1.1h-1c-.8 0-1.5-.2-2.1-.7-1.1-.9-1.5-2-1.1-3.3.3-1.3 1.2-2.1 2.5-2.4.2 0 .4-.1.6-.1h4.3c1.5 0 2.8 1 3.1 2.5.2.9 0 1.9-.6 2.6-.6.7-1.4 1.2-2.3 1.2h-1.4v1.1c6.2.5 11 3.3 14.3 8.3 2.5 3.7 3.5 7.8 3 12.2zm-34.5-2c0 4.3 1.7 8.4 4.8 11.5s7.2 4.8 11.5 4.8 8.4-1.7 11.5-4.8 4.8-7.2 4.8-11.5c0-9-7.3-16.3-16.3-16.3s-16.3 7.3-16.3 16.3zm17.3-22.6v1.1h1.3c.6 0 1-.5 1-1.1 0-.6-.5-1.1-1.1-1.1h-4.5c-.5 0-.9.3-1.1.9-.1.5.1 1 .5 1.2.4.2.8.2 1.2.2h.5v-1.1c0-.2.2-.3.3-.3H38c.4-.2.5 0 .5.2zM24.3 38.9h1.8c.2 0 .3-.2.3-.3v-1.2c0-.2-.2-.3-.3-.3h-1.8c-.2 0-.3.2-.3.3v1.2c0 .1.1.3.3.3zm2.9-5.8H27.5c.1 0 .2-.1.2-.2l.6-1.1c0-.1.1-.2 0-.3 0-.1-.1-.2-.2-.2l-1.6-.9c-.2-.1-.4 0-.5.1l-.6 1.1c0 .1-.1.2 0 .3 0 .1.1.2.2.2l1.6 1zm.4 9.8c-.1-.2-.3-.2-.5-.1l-1.6.9c-.1 0-.1.1-.2.2s0 .2 0 .3l.6 1.1c0 .1.1.1.2.2H26.4l1.6-.9c.1 0 .1-.1.2-.2s0-.2 0-.3l-.6-1.2z"
                  ></path>
                </g>
              </svg>
            </div>

            <p className={s.itemTitle}>Срочная доставка день в день</p>
            <p className={s.itemSubTitle}>
              Москва (до 50 км за МКАД).
              <br />
              Санкт-Петербург (до 50 км за КАД).
            </p>
            <p className={s.itemTabl}>
              А так же все города присутствия розничных магазинов LEGO. Время
              доставки уточняйте у оператора.
            </p>
          </div>
        </div>
        <p className={s.itemCost}>500 р</p>
      </div>
      <div className={s.item}>
        <div>
          <div className={s.itemContent}>
            <div className={s.itemIcon}>
              <svg id="delivery-store" viewBox="0 0 75 75">
                <g>
                  <circle
                    fill="#dd011c"
                    className="a5"
                    cx="37.5"
                    cy="37.5"
                    r="37.5"
                  ></circle>
                  <g>
                    <path
                      fill="#fff"
                      className="b5"
                      d="M28.5,30A6.5,6.5,0,1,0,22,23.5,6.508,6.508,0,0,0,28.5,30Zm0-11A4.5,4.5,0,1,1,24,23.5,4.507,4.507,0,0,1,28.5,19Z"
                    ></path>
                    <path
                      fill="#fff"
                      className="b5"
                      d="M59,46h-.184A2.966,2.966,0,0,0,59,45V33a3,3,0,0,0-3-3H46a3,3,0,0,0-3,3V45a2.966,2.966,0,0,0,.184,1H39.8L37.6,35.992C37.026,33.418,35.387,32,32.979,32h-8.96c-2.409,0-4.048,1.418-4.617,3.993L17.2,46H16a3,3,0,0,0-3,3v1a3,3,0,0,0,3,3H59a3,3,0,0,0,3-3V49A3,3,0,0,0,59,46ZM45,45V33a1,1,0,0,1,1-1H56a1,1,0,0,1,1,1V45a1,1,0,0,1-1,1H46A1,1,0,0,1,45,45ZM21.355,36.424C21.835,34.251,23.1,34,24.019,34h8.96c.914,0,2.183.251,2.663,2.424L37.755,46H19.244ZM60,50a1,1,0,0,1-1,1H16a1,1,0,0,1-1-1V49a1,1,0,0,1,1-1H59a1,1,0,0,1,1,1Z"
                    ></path>
                  </g>
                </g>
              </svg>
            </div>

            <p className={s.itemTitle}>Самовывоз</p>
            <p className={s.itemSubTitle}>
              Магазины LEGO снова открывают свои двери!
            </p>
            <p className={s.itemTabl}>
              Товар будет забронирован специально для вас в магазине на срок до
              3-х дней. Вам останется только прийти, оплатить и забрать.
            </p>
          </div>
        </div>
        <p className={s.itemCost}>Бесплатно</p>
      </div>
      <div className={s.item}>
        <div>
          <div className={s.itemContent}>
            <div className={s.itemIcon}>
              <svg id="delivery-postamat" viewBox="0 0 75 75">
                <g>
                  <circle fill="#dd011c" cx="37.5" cy="37.5" r="37.5"></circle>
                  <g>
                    <path
                      fill="#fff"
                      d="M55.263,28H39.237a3.386,3.386,0,0,0-1.737.48A3.381,3.381,0,0,0,35.763,28H19.737A3.137,3.137,0,0,0,16.5,31.019V52.981A3.137,3.137,0,0,0,19.737,56H35.763a3.381,3.381,0,0,0,1.737-.48,3.386,3.386,0,0,0,1.737.48H55.263A3.137,3.137,0,0,0,58.5,52.981V31.019A3.137,3.137,0,0,0,55.263,28ZM36.5,30.235V53.768a.254.254,0,0,1-.259.232H18.759a.255.255,0,0,1-.259-.235V30.235A.255.255,0,0,1,18.759,30H36.241a.254.254,0,0,1,.259.232Zm20,23.53a.255.255,0,0,1-.26.235H38.757a.254.254,0,0,1-.257-.232V30.232A.254.254,0,0,1,38.757,30H56.24a.255.255,0,0,1,.26.235Z"
                    ></path>
                    <path
                      fill="#fff"
                      d="M31.5,34h-8a1,1,0,0,0,0,2h8a1,1,0,0,0,0-2Z"
                    ></path>
                    <path
                      fill="#fff"
                      d="M31.5,38h-8a1,1,0,0,0,0,2h8a1,1,0,0,0,0-2Z"
                    ></path>
                    <path
                      fill="#fff"
                      d="M31.5,43a1,1,0,0,0-1,1v2a1,1,0,0,0,2,0V44A1,1,0,0,0,31.5,43Z"
                    ></path>
                    <path
                      fill="#fff"
                      d="M51.5,34h-8a1,1,0,0,0,0,2h8a1,1,0,0,0,0-2Z"
                    ></path>
                    <path
                      fill="#fff"
                      d="M51.5,38h-8a1,1,0,0,0,0,2h8a1,1,0,0,0,0-2Z"
                    ></path>
                    <path
                      fill="#fff"
                      d="M51.5,43a1,1,0,0,0-1,1v2a1,1,0,0,0,2,0V44A1,1,0,0,0,51.5,43Z"
                    ></path>
                    <path
                      fill="#fff"
                      d="M30,24a6,6,0,0,0,5.913-5.018A.838.838,0,0,0,36,19h6v2a1,1,0,0,0,2,0V19h2v2a1,1,0,0,0,2,0V19h2a1,1,0,0,0,0-2H36a.838.838,0,0,0-.087.018A6,6,0,1,0,30,24Zm0-10a4,4,0,1,1-4,4A4,4,0,0,1,30,14Z"
                    ></path>
                  </g>
                </g>
              </svg>
            </div>

            <p className={s.itemTitle}>Пункты выдачи / Постаматы</p>
            <p className={s.itemSubTitle}>
              Вы можете забрать свой заказ в одном из автоматических терминалов
              (постаматов) Pickpoint или пункте выдачи заказов.
            </p>
            <p className={s.itemTabl}>
              При заказе от 3000 ₽ бесплатная доставка. При заказе до 3000 ₽
              стоимость доставки будет рассчитана индивидуально в корзине при
              оформлении заказа.
            </p>
          </div>
        </div>
      </div>
      <div className={s.item}>
        <div>
          <div className={s.itemContent}>
            <div className={s.itemIcon}>
              <svg id="delivery-pin" viewBox="0 0 75 75">
                <g>
                  <circle
                    fill="#dd011c"
                    className="a5"
                    cx="37.5"
                    cy="37.5"
                    r="37.5"
                  ></circle>
                  <g>
                    <path
                      fill="#fff"
                      className="b5"
                      d="M44,29.5A6.5,6.5,0,1,0,37.5,36,6.509,6.509,0,0,0,44,29.5Zm-11,0A4.5,4.5,0,1,1,37.5,34,4.5,4.5,0,0,1,33,29.5Z"
                    ></path>
                    <path
                      fill="#fff"
                      className="b5"
                      d="M42.9,48.69c3.991-5.517,9.1-13.7,9.1-19.5a14.5,14.5,0,0,0-29,0c0,5.79,5.092,13.966,9.08,19.483C28.407,49.649,26,51.617,26,54c0,3.421,4.943,6,11.5,6S49,57.421,49,54C49,51.663,46.555,49.684,42.9,48.69ZM37.5,17A12.517,12.517,0,0,1,50,29.188c0,7.367-9.684,19.787-12.5,23.246C34.681,48.976,25,36.559,25,29.188A12.516,12.516,0,0,1,37.5,17Zm0,41c-5.6,0-9.5-2.108-9.5-4,0-1.379,2.079-2.87,5.373-3.578,1.817,2.409,3.192,4.026,3.365,4.228a1,1,0,0,0,1.52,0c.173-.2,1.548-1.819,3.366-4.228C44.919,51.13,47,52.621,47,54,47,55.892,43.1,58,37.5,58Z"
                    ></path>
                  </g>
                </g>
              </svg>
            </div>

            <p className={s.itemTitle}>Доставка по России</p>
            <p className={s.itemSubTitle}>
              При заказе от 3000 Р бесплатная доставка.
            </p>
            <p className={s.itemTabl}>
              При заказе до 3000 воспользуйтесь калькулятором на этой странице.
            </p>
          </div>
        </div>
        <p>*акция действует до конца текущего месяца</p>
      </div>
    </>
  );
};

export default DeliveryItem;
